package 真题;

/*
京东一面：攻城战
题目描述：
小七正在玩一款名为“工程战”的策略游戏。现在，小正在领自己的军队攻打一座城池。
通过一段时间的游戏，小七的军队目前有a辆坦克，而“攻防战”是一个回合制游戏，一个回合如下:
1.小七的军队中的每辆坦克攻击所选择的一座碉堡，这座碉堡损失一点生命值，当一座确理失去所有生命值时，
它就被摧毁了。小七可以为每辆坦克独立选择确碉堡。
2小七的对手进攻。炸毁k*c辆坦克，其中，k是剩余的碉堡数量，每个碉堡可以炸毁c辆坦克。
通过侦察兵，小七探明了敌情：战场上有d座敌方碉堡，每一座碉堡都有b点生命值，摧毁所有碉堡后，小七就攻下了这座城池
(即使小七没有坦克了，也算攻下了这座城池)。反之如果小七没有坦克了，敌方还有碉堡，小七就失败了。
现在小七想道自己能否获胜，你能帮帮小七吗?

输入描述：
一行四个空格隔开的整数a,b,c,d, 其中1<=a<= 1000000,1<=b,c,d<= 10000
输出描述：
输出一个数，如果小七可以获胜，输出所需的最小回合数。否则输出-1。

样例输入：
10 6 8 2
样例输出：
2

 */
public class 坦克攻击碉堡_回合策略 {

}
